# Taps
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap 'nicoverbruggen/homebrew-cask'

# Binaries
brew 'awscli'
brew 'bash' # Latest Bash version
brew 'coreutils' # Those that come with macOS are outdated
brew 'ffmpeg'
brew 'gh'
brew 'git'
brew 'grep'
brew 'httpie'
brew 'jq' # Used for spatie/visit
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'svn' # Needed to install fonts

# Spatie Medialibrary
brew 'jpegoptim'
brew 'optipng'
brew 'pngquant'
brew 'svgo'
brew 'gifsicle'

# Development
brew 'imagemagick'
brew 'meilisearch'
brew 'mysql'
brew 'redis'
brew 'powerlevel10k'
brew 'composer'

# Apps
cask '1password'
cask 'appcleaner'
cask 'dbngin'
cask 'discord'
cask 'displaylink'
cask 'fig'
cask 'figma'
cask 'firefox-developer-edition'
cask 'firefox'
cask 'github'
cask 'google-chrome-canary'
cask 'google-chrome'
cask 'helo'
cask 'herd'
cask 'imageoptim'
cask 'keyboardcleantool'
cask 'slack'
cask 'spotify'
cask 'tableplus'
cask 'the-unarchiver'
cask 'tinkerwell'
cask 'telegram'
cask 'transmit'
cask 'visual-studio-code'
cask 'vlc'

# Quicklook
cask 'qlmarkdown'
cask 'quicklook-json'

# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

# Mac App Store
mas 'Keynote', id: 409183694
mas 'Numbers', id: 409203825
mas 'Photobulk', id: 537211143
mas 'AutoMute', id:1118136179
mas 'PasteBot', id: 1179623856
mas 'Harvest', id: 506189836
mas 'LitteIpsum', id:405772121
mas 'BetterSnapTool', id: 417375580
mas 'Spark', id: 1176895641
#mas 'PasteBot', id: 1179623856